Revit 2026 API

# ImporterIFCUtils Methods

---

The ImporterIFCUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateEmptyFamily | Creates an empty family of a given category. |
|  | GetLocalFileName | Get the local file name, including the path, corresponding to a linked IFC file. This will create a local copy of the IFC file if necessary. |
|  | UpdateDirectShapeCategory | Updates the category of a DirectShape. |

#### Reference

ImporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace